# Pandas

- The pandas library a central component of the data science toolkit. 
- It is used in conjunction with other libraries in that collection.

- It is built on top of the NumPy package, meaning a lot of the structure of NumPy is used or replicated in Pandas. 

- Data in pandas is often used to feed statistical analysis in SciPy, plotting functions from Matplotlib, and machine learning algorithms in Scikit-learn.

Pandas is very similar to Excel. You will be comfortable working with structured data in Pandas when using Python

In [ ]:
import numpy as np
import pandas as pd
# import matplotlib.pyplot as plt

Tip: These three imports are very useful when performing data analysis in python. Stick to their alias, since it is the defacto in the industry.

In [ ]:
df = pd.read_csv('/content/sample_data/california_housing_train.csv', sep=',',)

In [ ]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

Pandas have 2 major data containers/data types, `Series` and `DataFrame`

In [ ]:
df['longitude']

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [ ]:
type(df), type(df['longitude'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

A series is similar in stuctured to a 1-array but will other information like index, header etc.

In [ ]:
df['longitude']

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [ ]:
df['longitude'].values # or use df['longitude'].to_numpy()

array([-114.31, -114.47, -114.56, ..., -124.3 , -124.3 , -124.35])

In [ ]:
df['housing_median_age'] = df['housing_median_age'].apply(lambda x: True if x > 15 else False)

In [ ]:
df['housing_median_age'] =

0        False
1        False
2        False
3        False
4        False
         ...
16995    False
16996    False
16997    False
16998    False
16999    False
Name: housing_median_age, Length: 17000, dtype: bool

Tip: Use `.values` to convert any pandas object to numpy. To convert directly to a list use the casting function `list`

In [ ]:
list(df['longitude'])[0: 5]

[-114.31, -114.47, -114.56, -114.57, -114.57]

Creating a Series by passing a list of values, letting pandas create a default integer index or include an index. You can create a pandas series from a python list, numpy array or dictionary

In [ ]:
ex1_labels = ['a','b','c']
ex1_list = [10, 20, 30]
ex1_arr = np.array([10,20,30])
ex1_dict = {'a' : 10,'b' : 20,'c' : 30}

In [ ]:
pd.Series(data=ex1_labels)

0    a
1    b
2    c
dtype: object

In [ ]:
pd.Series(data=ex1_list, index=ex1_labels)

a    10
b    20
c    30
dtype: int64

Create a pandas series object using ex1_arr and ex1_dict

In [ ]:
pd.Series(data=ex1_arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=ex1_dict)

a    10
b    20
c    30
dtype: int64

NB: The datatype shown indicates the type of python object currently stored in the Series container

### Operations on Series

In [ ]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany','USSR', 'Japan']) 
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany','Italy', 'Japan'])

In [ ]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [ ]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [ ]:
ser1 * ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

## Dataframe

This is the workhorse of Pandas.

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df2 = pd.DataFrame(randn(5,4),
                   index=list('ABCDE'),
                   columns='U V W X'.split()
                   )

In [ ]:
df2.head()

          U         V         W         X
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Pandas can store almost any python object in its dataframe.

In [ ]:
df2.dtypes

U    float64
V    float64
W    float64
X    float64
dtype: object

In [ ]:
df3 = pd.DataFrame(
            {
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo",
            }
          )

In [ ]:
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
df3.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Tip: Different datatypes can be stored in the same dataframe, not necessarily objects of the same datatype. When the objects in a column are strings or of mixed types, the column is given a type, `object`

Classwork 1:
Create a pandas dataframe with the following datatypes as columns:
- float32
- int
- object

Print the datatypes of your dataframe

In [ ]:
## TODOD:



  df = pd.DataFrame(
            {
            "A": np.array([1.0, 2.5, 7.6, 2.2],),
            "D": np.array([3] * 4,),
            "F": ["baa", "saa", "taa", "laa"]
            }
          )

In [ ]:
df_class.dtypes

A    float32
D      int32
F     object
dtype: object

### Selection and Indexing

In [ ]:
obj1 = df3['A']
obj1

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [ ]:
type(obj1)

pandas.core.series.Series

In [ ]:
obj2 = df3[['A']]
obj2

     A
0  1.0
1  1.0
2  1.0
3  1.0

In [ ]:
type(obj2)

pandas.core.frame.DataFrame

Tip: To return a dataframe from a selection, use double brackets

In [ ]:
df3[['B', 'C']]

           B    C
0 2013-01-02  1.0
1 2013-01-02  1.0
2 2013-01-02  1.0
3 2013-01-02  1.0

In [ ]:
# df.longitude # not commonly used because it can fail in some instance

In [ ]:
len(df)

17000

In [ ]:
df4 = df[0:100].copy()

In [ ]:
df4.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
df4['pop/household'] = df4['population'] / df4['households']

In [ ]:
df4

    longitude  latitude  ...  median_house_value  pop/household
0     -114.31     34.19  ...             66900.0       2.150424
1     -114.47     34.40  ...             80100.0       2.438445
2     -114.56     33.69  ...             85700.0       2.846154
3     -114.57     33.64  ...             73400.0       2.278761
4     -114.57     33.57  ...             65500.0       2.381679
..        ...       ...  ...                 ...            ...
95    -115.58     32.81  ...             96300.0       3.202797
96    -115.58     32.81  ...             87500.0       2.651741
97    -115.58     32.79  ...             64400.0       1.689579
98    -115.58     32.78  ...            110100.0       3.363420
99    -115.59     32.85  ...             90800.0       3.475806

[100 rows x 10 columns]

### Removing columns

In [ ]:
df4.drop('population', axis=1)

    longitude  latitude  ...  median_house_value  pop/household
0     -114.31     34.19  ...             66900.0       2.150424
1     -114.47     34.40  ...             80100.0       2.438445
2     -114.56     33.69  ...             85700.0       2.846154
3     -114.57     33.64  ...             73400.0       2.278761
4     -114.57     33.57  ...             65500.0       2.381679
..        ...       ...  ...                 ...            ...
95    -115.58     32.81  ...             96300.0       3.202797
96    -115.58     32.81  ...             87500.0       2.651741
97    -115.58     32.79  ...             64400.0       1.689579
98    -115.58     32.78  ...            110100.0       3.363420
99    -115.59     32.85  ...             90800.0       3.475806

[100 rows x 9 columns]

In [ ]:
df4.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'pop/household'],
      dtype='object')

Tip: Always set `inplace=True` to perform an operation on a dataframe or make a copy of the operation by assigning to another dataframe

In [ ]:
df4.drop('population', axis=1, inplace=True)
# or
# df4 = df4.drop('population', axis=1)
# del df4['population']

In [ ]:
df4 = df4.drop(["households"], axis=1)

In [ ]:
df4.head()

   longitude  latitude  ...  median_house_value  pop/household
0    -114.31     34.19  ...             66900.0       2.150424
1    -114.47     34.40  ...             80100.0       2.438445
2    -114.56     33.69  ...             85700.0       2.846154
3    -114.57     33.64  ...             73400.0       2.278761
4    -114.57     33.57  ...             65500.0       2.381679

[5 rows x 8 columns]

Drop rows

In [ ]:
df10 = df4.drop([1, 2], axis=0)

In [ ]:
df10.head()

   longitude  latitude  ...  median_house_value  pop/household
0    -114.31     34.19  ...             66900.0       2.150424
3    -114.57     33.64  ...             73400.0       2.278761
4    -114.57     33.57  ...             65500.0       2.381679
5    -114.58     33.63  ...             74000.0       2.807531
6    -114.58     33.61  ...             82400.0       2.908373

[5 rows x 8 columns]

classwork 2:

- Compute the total number of bedrooms per household
- Which location has the highest number of bedrooms per household

In [ ]:
df4["bedrooms/household"] = df4["total_bedrooms"]/df4["household"]

KeyError: ignored

### Viewing data

In [ ]:
df.index

In [ ]:
df4.columns

In [ ]:
df4.head(10)

In [ ]:
df4.tail(2)

Tip: Use `.columns` and `.index` to get the column names or index names respectively. Use `.head()` and `.tail` to get the beginning or end of the dataframe or series.

Select rows

In [ ]:
df4.iloc[2]

In [ ]:
df10.iloc[[1, 2]]

In [ ]:
df10.loc[[0, 5]]

In [ ]:
df.loc[3]

Tip: `.loc` is used for indexing when the list of indexes are not non-numbers

In [ ]:
df3.to_numpy()

Tip: Convert dataframe to numpy using `.to_numpy()`. Does not include column names or indices

In [ ]:
df10.describe()

In [ ]:
df3.info()

In [ ]:
df3.iloc[0, 1] = np.nan

In [ ]:
df3

In [ ]:
df2

In [ ]:
df2.sort_values(by='W', ascending=False)

### Conditional Selection

In [ ]:
df2

In [ ]:
df2 > 0

In [ ]:
df2[df2 > 0]

In [ ]:
df2[df2['W'] > 0]

For two conditions you can use | and & with parenthesis:

In [ ]:
df2[(df2['U']>0) & (df2['X'] > 0.1)]

Select from df10 where the population/household is greater than 1.5, and the income is not more than 50.

In [ ]:
df10[(df10["pop/household"] > 1.5) & (df10["median_income"] <= 50)]

In [ ]:
df.head()

In [ ]:
df10

In [ ]:
# Reset to default 0,1...n index

df10.reset_index()

Tip: Use `drop=True` to drop the old index from the dataframe

In [ ]:
df10.reset_index(drop=True, inplace=True)

In [ ]:
df10.head()

### Dealing with missing data

In [ ]:
df5 = pd.DataFrame({'A':[1,2,np.nan],
                    'B':[5,np.nan,np.nan],
                    'C':[1,2,3]})

In [ ]:
df5

In [ ]:
df5.dropna()

In [ ]:
df5.dropna(axis=1)

In [ ]:
df5.dropna(axis=0, thresh=2)

In [ ]:
df5.fillna(value=0)

In [ ]:
df5.fillna(value=df5.mean())

### Groupby

In [ ]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Ahmed','Kobby','Aissa','Modou','Nando','Armand'],
       'Result':[200, 120, 340,124,243,350]}

In [ ]:
  data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Ahmed','Kobby','Aissa','Modou','Nando','Armand'],
       'Result':[200, 120, 340,124,243,350]}

  df = pd.DataFrame(data)
  by_comp = df.groupby("Company")
  by_comp.max()[['Person']]

In [ ]:
df6 = pd.DataFrame(data)

In [ ]:
df6

Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [ ]:
df6.groupby('Company')

In [ ]:
comp_mean = df6.groupby("Company").mean()

In [ ]:
comp_mean

In [ ]:
comp_std = df6.groupby("Company").std()

In [ ]:
by_comp = df6.groupby("Company")

In [ ]:
by_comp.min()[['Result']]

In [ ]:
by_comp.max()[['Person']]

In [ ]:
by_comp.count()[['Person']]

In [ ]:
by_comp.describe()

In [ ]:
by_comp.describe().T

In [ ]:
by_comp.describe().transpose()['GOOG']

### Merging, Joining and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating

In [ ]:
df_a = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df_a

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df_b = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df_b

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df_c = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df_c

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation

In [ ]:
pd.concat([df_a, df_b, df_c])

In [ ]:
pd.concat([df_a, df_b, df_c], axis=1)

Merging

In [ ]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on=['key1'])

In [ ]:
pd.merge(left, right, on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [ ]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left

In [ ]:
right

In [ ]:
left.join(right)

In [ ]:
left.join(right, how='outer')

Other Pandas operations

In [ ]:
df7 = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444, 555, 666, 444],
                   'col3':['abc','def','ghi','xyz']})

df7.head()

Information on unique values

In [ ]:
# To get unique values in a dataframe
df7['col2'].unique()

In [ ]:
df7['col2'].nunique()

In [ ]:
df7['col2'].value_counts()

Selecting data

In [ ]:
#Select from DataFrame using criteria from multiple columns
newdf = df7[(df6['col1']>2) & (df7['col2']==444)]

In [ ]:
newdf

Applying functions

In [ ]:
def times2(x):
    return x*2

In [ ]:
df7['col1'].apply(times2)

In [ ]:
df['col'].apply(lambda x: x*2)

In [ ]:
df7['col3'].apply(len)

Classwork 1: Calculate the approximate distance between each house in california and mbour. Hint: Use the longitude and latitude of mbour

Append the distance as a new column to the dataframe. Name the column, `approx dist`. Check https://stackoverflow.com/a/1420059 for ideas

In [ ]:
## TODO: Classwork 2





###########################

In [ ]:
df7['col1'].sum()

Find Null Values or Check for Null Values

In [ ]:
df7.isnull() # or df6.isna()

In [ ]:
# Drop rows with NaN Values
df7.dropna()

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df8 = pd.DataFrame(data)

In [ ]:
df8.pivot_table(values='D', index=['A', 'B'], columns=['C'])

Data input and output

In [ ]:
# Save dataframe as a csv file

df8.to_csv('example7.csv', index=False)

In [ ]:
# import csv file into a dataframe

df8 = pd.read_csv('example7.csv')

In [ ]:
# import json file as 

df9 = pd.read_json('/content/sample_data/anscombe.json')

In [ ]:
df9

Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

In [ ]:
df9.to_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [ ]:
df9 = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

Pandas can read table tabs off of html. For example:

In [ ]:
df10 = pd.read_html('https://en.wikipedia.org/wiki/Local_government_areas_of_Nigeria')

In [ ]:
df10[2].head()

Pandas can also read from SQL, just so you know :)

Other resources to learn about Pandas

- https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html
- https://pandas.pydata.org/pandas-docs/stable/user_guide/cookbook.html#cookbook

## The End.